/* Объектом какого класса является document?

Какое место он занимает в DOM-иерархии?

Наследует ли он от Node или от Element, или может от HTMLElement? */


//Объект document является экземпляром класса Document.

//Document является одним из интерфейсов DOM, 
//который представляет собой иерархическую структуру документа, которую можно изменять с помощью JavaScript.

//Document наследует от интерфейса Node и является родительским элементом для других элементов в DOM, 
//таких как HTMLElement и XMLDocument.