/* 
    В JavaScript, как и в других языках программирования, числа с плавающей точкой хранятся в двоичной системе счисления, и некоторые десятичные дроби могут быть представлены только приблизительно.

    Например, число 0.2 в двоичной системе счисления будет представлено как бесконечная дробь 0.001100110011... (периодическая последовательность). 
    При сложении с переменной i оно будет округлено до ближайшего числа, которое может быть представлено в двоичной системе счисления, и этот процесс будет повторяться при каждом проходе цикла.

    В конечном итоге переменная i может стать чуть больше или меньше 10, но никогда не станет равной 10, и цикл будет продолжаться бесконечно. 
*/